In [1]:
import pandas as pd

data={'Name':["John","Anna","Peter","Linda"],
     'Location':["New York","Paris","Berlin","London"],
     'Age':[24,13,53,33],
     'blood type':["O","AB","A","B"]}

data_pandas=pd.DataFrame(data)
display(data_pandas)

    Name  Location  Age blood type
0   John  New York   24          O
1   Anna     Paris   13         AB
2  Peter    Berlin   53          A
3  Linda    London   33          B

In [2]:
display(data_pandas[data_pandas.Age<30])

   Name  Location  Age blood type
0  John  New York   24          O
1  Anna     Paris   13         AB

In [4]:
from sklearn.datasets import load_iris
iris_dataset=load_iris()
iris_dataset.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename'])

In [9]:
iris_dataset['DESCR'][:193]+"\n..."

'.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, pre\n...'

In [10]:
iris_dataset['target_names']

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [11]:
iris_dataset['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [13]:
type(iris_dataset['data'])

numpy.ndarray

In [14]:
iris_dataset['data'].shape

(150, 4)

In [15]:
iris_dataset['data'][:5]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2],
       [4.6, 3.1, 1.5, 0.2],
       [5. , 3.6, 1.4, 0.2]])

In [16]:
type(iris_dataset['target'])

numpy.ndarray

In [17]:
iris_dataset['target'].shape

(150,)

In [18]:
iris_dataset['target']

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])